# SetObjPropCharVS

## Description
```pascal
FUNCTION SetObjPropCharVS(
				PropertyID  : LONGINT;
				PropertyVal : CHAR) : BOOLEAN;
```

```python

def vs.SetObjPropCharVS(PropertyID, PropertyVal):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|PropertyID|LONGINT||
|PropertyVal|CHAR||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events